Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: ཨུ་དུམ་བཱ་རའི་ཚལ་འདི་ནི་ཁྱོད་ཀྱི་བསོད་ནམས་ཀྱིས་རྣམ་པ་ཐམས་ཅད་དུ་མེ་ཏོག་རྒྱས་པར་གྱུར་པ་མ་ཡིན་གྱི། ས་ཕྱོགས་འདི་ནི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོའི་སྐྱེད་མོས་ཚལ་གྱིས་ཡིན་ཏེ
en: “It was not at all on account of your merit that the flowers in the udumbara forest bloomed, for this place is the royal garden of a great universal monarch.

source: གང་གི་ཚེ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་འབྱུང་ངམ། བྱང་ཆུབ་སེམས་དཔའ་འབྱུང་བར་འགྱུར་བ་དེའི་ཚེ་ནི་ཨུ་དུམ་བཱ་རའི་ཚལ་འདིར་མེ་ཏོག་རྣམས་ཁ་འབུ་བར་འགྱུར་རོ། །
en: The flowers in the udumbara forest first blossom whenever a universal monarch or a bodhisattva appears.

source: གང་གི་ཚེ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་རྒྱལ་སར་ཞུགས་པའམ། བྱང་ཆུབ་སེམས་དཔས་བླ་ན་མེད་པའི་ཡེ་ཤེས་བརྙེས་པར་གྱུར་པ་དེའི་ཚེ་ནི་ཨུ་དུམ་བཱ་རའི་ཚལ་འདི་རྣམ་པ་ཐམས་ཅད་དུ་མེ་ཏོག་རྒྱས་པར་འགྱུར་རོ། །
en: Whenever a universal monarch is enthroned on his royal seat or a bodhisattva achieves unexcelled wisdom, flowers fully bloom throughout the udumbara forest.

source: གང་གི་ཚེ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་གྲོངས་སུ་ཉེ་བའམ། དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདར་ཉེ་བར་གྱུར་པ་དེའི་ཚེ་ནི་ཨུ་དུམ་བཱ་རའི་ཚལ་གྱི་མེ་ཏོག་འདི་རྣམས་རྙིས་པར་འགྱུར་རོ། །
en: Whenever the time is near for the passing of the universal monarch or for the Tathāgata to pass into parinirvāṇa, the flowers of the udumbara forest begin to fade.

source: གང་གི་ཚེ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་གྲོངས་སམ། དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་གྱུར་པ་དེའི་ཚེ་ནི་ཨུ་དུམ་བཱ་རའི་ཚལ་འདིའི་མེ་ཏོག་རྣམས་སྐམ་པར་འགྱུར་ཏེ
en: When the universal monarch passes or the Tathāgata enters parinirvāṇa, the flowers of the udumbara forest wither.

source: ད་ལྟར་ཡང་དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་དུ་བྱུང་ནས་དེ་གཟིམས་མལ་གྱི་ཐ་མར་ཞུགས་ཏེ།
en: “Now the Tathāgata is in the world, and he has taken to his final bed.

source: དོ་ནུབ་ནམ་ཕྱེད་ན་ཕུང་པོའི་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་འགྱུར་ཏེ།
en: Tonight, in the middle of the night, he will pass beyond sorrow into the realm of nirvāṇa without any remainder of the aggregates.

source: དེའི་དབང་གིས་ཨུ་དུམ་བཱ་རའི་ཚལ་དེ་རྙིས་པར་གྱུར་གྱིས་ཁྱོད་དེའི་རྒྱུས་ཧ་ཅང་མྱ་ངན་མ་བྱེད་ཅིག །
en: This is why the udumbara forest is fading. Do not mourn so.

source: སྡུག་བསྔལ་བར་མ་བྱེད་ཅིག །
en: Do not suffer so.

source: སྨྲེ་སྔགས་མ་འདོན་ཅིག་ཅེས་བྱས་སོ། །
en: Do not lament.”

source: དེ་ནས་ཀུན་ཏུ་རྒྱུ་རབ་བཟང་འདི་སྙམ་དུ་སེམས་ཏེ།
en: The mendicant Subhadra thought,

source: བདག་ཆོས་རྣམས་ལ་ཡང་ཐེ་ཙོམ་ཡོད།
en: “I have doubts about the Dharma,

source: བདག་ལ་རེ་བ་ཡང་ཡོད་ལ། བཅོམ་ལྡན་འདས་གཽ་ཏ་མ་དེས་ཀྱང་བདག་གི་ཐེ་ཙོམ་དེ་སེལ་བར་ནུས་ཀྱིས།
en: but I have hope that the Blessed Gautama can dispel my doubts.

source: མ་ལ་བདག་བཅོམ་ལྡན་འདས་གཽ་ཏ་མ་དེ་ག་ལ་བ་དེར་སོང་ལ་དེར་ཕྱིན་ནས་ཞུ་བ་ལུང་བསྟན་པར་གནང་ན་ཕྱོགས་འགའ་ཞིག་ཞུའོ་སྙམ་ནས་
en: I will go see the Blessed Gautama, and if he agrees to answer my questions, I shall ask some questions of him.”

source: ཨུ་དུམ་བཱ་རའི་ཚལ་ནས་མི་སྣང་བར་གྱུར་ཏེ་གྲོང་ཁྱེར་ཀུ་ཤི་ན་གྱད་ཀྱི་ཉེ་འཁོར་ཤིང་ས་ལ་ཟུང་གི་ཚལ་དུ་ཕྱིན་པར་གྱུར་ཏོ། །
en: So he disappeared from the udumbara forest and traveled to the copse of two śāla trees near Kuśinagarī.

source: དེའི་ཚེ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ནི་ཀུན་དགའ་ར་བའི་སྒོའི་ཐད་ཀྱི་འཆག་ས་ན་འཆག་ཅིང་འདུག་གོ། །
en: At that time Venerable Ānanda drew near to the gates of Kuśinagarī and seated himself.

source: དེ་ནས་ཀུན་ཏུ་རྒྱུ་རབ་བཟང་གིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ཐག་རིང་པོ་ཞིག་ནས་མཐོང་ངོ་། །
en: The mendicant Subhadra saw Venerable Ānanda from a distance,

source: མཐོང་ནས་ཀྱང་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་
en: and went to where Venerable Ānanda was.

source: ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Upon his arrival he said to Venerable Ānanda,

source: བཙུན་པ་ཀུན་དགའ་བོ་བདག་གིས་ཐོས་ན་བཅོམ་ལྡན་འདས་གཽ་ཏ་མ་དོ་ནུབ་ནམ་ཕྱེད་ན་ཕུང་པོའི་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་རོ་ཞེས་གྲག་ན
en: “Lord Ānanda, I have heard that tonight, in the middle of the night, the Blessed One will pass beyond all sorrow into the realm of nirvāṇa without any remainder of the aggregates.

source: བདག་ཆོས་རྣམས་ལ་ཡང་ཐེ་ཙོམ་མཆིས། བདག་ལ་རེ་བ་ཡང་མཆིས་ལ། བཅོམ་ལྡན་འདས་གཽ་ཏ་མ་དེས་ཀྱང་བདག་གི་ཐེ་ཙོམ་དེ་སེལ་བར་ནུས་ན།
en: I have doubts about the Dharma but I have hope that the Blessed Gautama can dispel my doubts.

source: གལ་ཏེ་བཙུན་པ་ཀུན་དགའ་བོ་འོ་མི་བརྒྱལ་ན་བཅོམ་ལྡན་འདས་གཽ་ཏ་མ་དེ་ག་ལ་བཞུགས་པ་དེར་བཞུད་ལ། དེར་ཕྱིན་ནས་གལ་ཏེ་ཞུ་བའི་བཀའ་ལན་སྩལ་བར་གནང་ན་ཕྱོགས་འགའ་ཞིག་ཞུའོ་ཞེས་བྱས་སོ། །
en: Oh Lord Ānanda, if it’s no trouble, I will go see the Blessed Gautama, and if he agrees to answer my questions when I arrive, I will ask some questions of him.”

source: ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ཡང་ལྟས་ལ་མཁས་ཏེ། དེས་བསམས་ན་
en: Venerable Ānanda, being skilled in the interpretation of signs, thought,

source: བཅོམ་ལྡན་འདས་ཀྱི་སྤྲུལ་པ་ཞིག་བཞག་སྟེ་
en: “The Blessed One has left an emanation here,

source: འདུལ་བའི་དབང་གིས་ག་ཞིག་ཏུ་གཤེགས་པར་རིག་ནས་ཀུན་ཏུ་རྒྱུ་རབ་བཟང་ལ་སྨྲས་པ།
en: and departed using his powers of subjugation.” Understanding this, he said to the mendicant Subhadra,

source: རབ་བཟང་ཐོང་།
en: “Relent, Subhadra.

source: བཅོམ་ལྡན་འདས་ནི་སྐུ་མཉེལ། བདེ་བར་གཤེགས་པ་ནི་སྐུ་མཉེལ་གྱིས།
en: The Blessed One is tired, the Tathāgata is tired.

source: དེ་བཞིན་གཤེགས་པ་ལ་གནོད་པ་མ་བྱེད་ཅིག་ཅེས་བྱས་སོ། །
en: Don’t trouble the Tathāgata.”

source: དེ་ནས་ཀུན་དུ་རྒྱུ་རབ་བཟང་གིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: The mendicant Subhadra said to Venerable Ānanda,

source: བཙུན་པ་ཀུན་དགའ་བོ་སྔོན་གྱི་ཀུན་དུ་རྒྱུ་རྒས་ཤིང་འཁོགས་ལ་
en: “Lord Ānanda, the mendicants of old are aged and infirm now.

source: གཏུགས་པ་རྣམས་ལས་བདག་གིས་ཐོས་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ནི་བརྒྱ་ལམ་བརྒྱ་ལམ་ན་འཇིག་རྟེན་དུ་འབྱུང་བར་ཟད་དེ།
en: It was from them that I heard that the tathāgatas, the arhats, the totally and completely awakened buddhas emerge in the world but rarely,

source: དཔེར་ན་ཨུ་དུམ་བཱ་རའི་མེ་ཏོག་བཞིན་ནོ་ཞེས་མཆི་ལ།
en: like the udumbara flower.

source: བཅོམ་ལྡན་འདས་གཽ་ཏ་མ་དེ་ཡང་དོ་ནུབ་ནམ་ཕྱེད་ན་ཕུང་པོའི་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་ནབདག་ཆོས་རྣམས་ལ་ཡང་ཐེ་ཙོམ་མཆིས། བདག་ལ་རེ་བ་ཡང་མཆིས་ལ། བཅོམ་ལྡན་འདས་གཽ་ཏ་མ་དེས་ཀྱང་བདག་གི་ཐེ་ཙོམ་སེལ་བར་ནུས་ན། གལ་ཏེ་བཙུན་པ་ཀུན་དགའ་བོ་འོ་མི་བརྒྱལ་ན། བཅོམ་ལྡན་འདས་གཽ་ཏ་མ་དེ་ག་ལ་བཞུགས་པ་དེར་བཞུད་ལ།
en: If tonight, in the middle of the night, the Blessed Gautama will pass beyond all sorrow into the realm of nirvāṇa without any remainder of the aggregates, then since I have some doubts about the Dharma and hope that the Blessed Gautama can dispel my doubts, and if it’s no trouble, Lord Ānanda, let me go see the Blessed Gautama.

source: དེར་ཕྱིན་ནས་གལ་ཏེ་ཞུ་བའི་བཀའ་ལན་སྩལ་བར་གནང་ན་ཕྱོགས་འགའ་ཞིག་ཞུའོ་ཞེས་བྱས་སོ། །
en: If he agrees to answer my questions when I arrive, I will ask some questions of him.”

source: དེ་ནས་ལན་གསུམ་གྱི་བར་དུ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་ཀུན་ཏུ་རྒྱུ་རབ་བཟང་ལ་སྨྲས་པ།
en: Three times Ānanda answered the mendicant Subhadra,

source: དེ་ནས་དེའི་སྐབས་སུ་བཅོམ་ལྡན་འདས་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷའི་ནང་ནས་མི་སྣང་བར་གྱུར་ཏེ། གཟིམས་མལ་དུ་ཞུགས་ནས།
en: At that very moment the Blessed One disappeared from among the gods of the Heaven of the Thirty-Three and took to his bed.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ལྷའི་སྙན་རྣམ་པར་དག་པ་མི་ལས་འདས་པ་མངའ་བས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ཀུན་ཏུ་རྒྱུ་རབ་བཟང་དང་དེ་ལྟ་བུའི་ཚིག་བརྗོད་པ་གསན་ཏོ། །
en: With his perfectly clear divine hearing, which transcends that of normal humans, the Blessed One heard the words that Venerable Ānanda was speaking to the mendicant Subhadra

source: གསན་ནས་ཀྱང་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ཐོང་།
en: and the Blessed One instructed Venerable Ānanda, “Ānanda, send him in.

source: ཀུན་ཏུ་རྒྱུ་རབ་བཟང་མ་དགག་པར་ནང་དུ་ཐོང་ལ་ཅི་དང་ཅི་འདོད་པ་འདྲིར་ཆུག་ཤིག །
en: Send the mendicant Subhadra inside, and do not impede him. Let him ask whatever he likes.

source: འདི་ནི་ང་གཞན་མུ་སྟེགས་ཅན་ཀུན་ཏུ་རྒྱུ་དག་དང་བར་སྐབས་ཀྱི་གཏམ་བརྗོད་པའི་ཐ་མ་ཡིན་ནོ། །འདི་ལྟ་སྟེ། ཀུན་ཏུ་རྒྱུ་རབ་བཟང་འདི་ནི་ངས་དགེ་སློང་ཚུར་ཤོག་ཅེས་བྱ་བས་རབ་ཏུ་ཕྱུང་བ་རྣམས་ཀྱི་ཐ་མ་ཡིན་ནོ། །
en: This is the last occasion on which I shall address those who hold extreme views, and this mendicant, Subhadra, will be the last monk I shall lead to go forth with the words ‘Come, monk!’ ”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་སྐབས་ཕྱེ་ནས་ཀུན་ཏུ་རྒྱུ་རབ་བཟང་དགའ་ཞིང་མགུ་ལ་ཡི་རངས་ཤིང་མགུ་ལ་རབ་ཏུ་དགའ་སྟེ།
en: The mendicant Subhadra was joyful, overjoyed, and elated that the Blessed One had granted this opportunity.

source: ཡི་རངས་ཤིང་དགའ་བ་དང་བདེ་བ་སྐྱེས་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བཞུགས་པ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: In his jubilation, joy, and gladness he went to see the Blessed One.

source: བཅོམ་ལྡན་འདས་དང་ལྷན་ཅིག་ཏུ་མངོན་སུམ་དུ་ཡང་དག་པར་དགའ་བ་དང་། ཡང་དག་པར་མགུ་བར་འགྱུར་བའི་གཏམ་སྣ་ཚོགས་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །
en: Upon his arrival he made all manner of entertaining and jovial conservation with the Blessed One, then took a seat at one side.

source: ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་བཅོམ་ལྡན་འདས་ལ་ཀུན་ཏུ་རྒྱུ་རབ་བཟང་གིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Once he had taken a seat at one side, the mendicant Subhadra said to the Blessed One,

source: ཀྱེ་གཽ་ཏ་མ་འཇིག་རྟེན་ན་མུ་སྟེགས་ཀྱི་གནས་ཐ་དད་པ་འདི་དག་ནི་འདི་ལྟ་སྟེ། འོད་སྲུང་རྫོགས་བྱེད་དང་། ཀུན་ཏུ་རྒྱུ་གནག་ལྷས་ཀྱི་བུ་དང་། སྨྲ་འདོད་ཀྱི་བུ་མོའི་བུ་ཡང་དག་རྒྱལ་བ་ཅན་དང་། མི་ཕམ་སྐྲའི་ལ་བ་ཅན་དང་། ཀ་ཏྱའི་བུ་ནོག་ཅན་དང་། གཅེར་བུ་པ་གཉེན་གྱི་བུ་དེ་རྣམས་ཀྱིས་རང་རང་གིས་དམ་བཅས་པ་ལགས་སོ། །
en: “Gautama, in the world people hold many different kinds of extreme views, such as those of Pūraṇa Kāśyapa , Parivrājaka Gośālīputra, Saṃjayin Vairaṭīputra, Ajita Keśakambala, Kakuda Kātyāyana, and Nirgrantha Jñātiputra, each of them with their own sacred pledges.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་བཀའ་སྩལ་པ།
en: Then the Blessed One responded in verse, saying:

source: རབ་བཟང་ང་ནི་ན་ཚོད་ཉི་ཤུ་དགུ་ལོན་ན
en: “Subhadra, at twenty-nine I went forth to seek the good.

source: ལེགས་པ་གང་ཡིན་ཚོལ་ཕྱིར་རབ་ཏུ་བྱུང་བར་གྱུར། །རབ་བཟང་ང་ནི་རབ་ཏུ་བྱུང་བའི་ཕྱིན་ཅད་ནས། །ལོ་གྲངས་ལྔ་བཅུའི་བར་དུ་ཏིང་འཛིན་བསྒོམ་པ་བྱས། །
en: “Subhadra, after going forth, I cultivated concentration for fifty years.

source: ང་ནི་ཚུལ་ཁྲིམས་རྣམས་དང་ཞབས་དང་རིག་པ་དང་། །སེམས་ཀྱི་རྩེ་གཅིག་བཏུད་པ་དག་ཀྱང་བསྒོམ་པ་བྱས། །
en: “I cultivated ethics, proper conduct, wisdom, And single-pointed concentration.

source: རིགས་པར་ལྡན་པའི་ཆོས་ཀྱི་ཕྱོགས་ཙམ་བརྗོད་པ་ཡང་། །འདི་ལས་ཕྱི་རོལ་པ་ཡི་དགེ་སྦྱོང་གཞན་ལ་མེད། །
en: “Ascetics from other factions do not even have A measure of the correct Dharma I expound.

source: རབ་བཟང་ཆོས་འདུལ་བ་གང་ལ་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་མེད་པ་དེ་ལ་ནི་དགེ་སྦྱོང་དང་པོ་ཡང་མེད་དོ། །དེ་ལ་ནི་དགེ་སྦྱོང་གཉིས་པ་དང་། གསུམ་པ་དང་། བཞི་པ་ཡང་མེད་དོ། །
en: “Subhadra, a Dharma and Vinaya in which there is no noble eightfold path lacks even the first monastic practitioner, and lacks the second, third, and fourth as well.

source: རབ་བཟང་ཆོས་འདུལ་བ་གང་ལ་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཡོད་པ་དེ་ལ་ནི་དགེ་སྦྱོང་དང་པོ་དང་། གཉིས་པ་དང་། གསུམ་པ་དང་། བཞི་པ་ཡང་ཡོད་དེ།
en: Subhadra, a Dharma and Vinaya that includes the noble eightfold path has the first monastic practitioner, and the second, third, and fourth as well.

source: དེ་བས་ན་འདི་ལས་ཕྱི་རོལ་པའི་དགེ་སྦྱོང་རྣམས་སམ་བྲམ་ཟེ་རྣམས་ནི་མེད་དེ། ཕ་རོལ་རྒོལ་བའི་དགེ་སྦྱོང་རྣམས་སམ་བྲམ་ཟེ་རྣམས་ཀྱིས་སྟོང་ངོ་ཞེས་
en: That is why I have said that there are no ascetics or brahmins of other factions, for espousing false doctrines, they are devoid of ascetics and brahmins.

source: ང་ནི་དེ་སྐད་དུ་འཁོར་འདིར་སེང་གེའི་སྒྲ་ཡང་དག་པར་སྒྲོགས་སོ་ཞེས་གསུངས་སོ། །
en: With a lion’s perfect roar I proclaim this before the assembly.”

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པ་ན་ཀུན་ཏུ་རྒྱུ་རབ་བཟང་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་ལ་རྣམ་པར་དག་སྟེ།
en: When this Dharma teaching had been explained, the mendicant Subhadra was able to see these things unobscured, with the Dharma vision that has no trace of dust or stain with respect to phenomena.

source: ཀུན་ཏུ་རྒྱུ་ཆོས་མཐོང་ལ་ཆོས་རྙེད་པ། ཆོས་རྟོགས་པ། ཆོས་ཀྱི་གཏིང་སླེབས་པ། སོམ་ཉི་ལས་རྒལ་བ། ཐེ་ཙོམ་ལས་རྒལ་བ།
en: Subhadra perceived the truths, discovered the truths, realized the truths, and fathomed the truths to their very depths, until he overcame whatever doubts or hesitation he had.

source: གཞན་གྱི་དྲིང་མི་འཇོག་པ། གཞན་གྱིས་བཀྲིར་མེད་པ། སྟོན་པའི་བསྟན་པའི་ཆོས་རྣམས་ལ་མི་འཇིགས་པ་ཐོབ་པར་གྱུར་ནས་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནསབཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་སྨྲས་པ།
en: Then of his own accord, completely unprompted, and unafraid of the truths his teacher had taught him, he rose from his seat, drew down the right shoulder of his upper garment, bowed toward the Blessed One with palms pressed together, and said to Venerable Ānanda,

source: བཙུན་པ་ཀུན་དགའ་བོས་ནི་རྙེད་པ་ལེགས་པར་རྙེད་དོ། །
en: “Lord Ānanda, you have achieved much that is good.

source: བཙུན་པ་ཀུན་དགའ་བོ་སློབ་དཔོན་ཆེན་པོས་སློབ་དཔོན་ཆེན་པོའི་ཉེ་གནས་སུ་དབང་བསྐུར་བ་ལགས་སོ། །
en: Lord Ānanda, you have been empowered as a great master by the great master himself.

source: བདག་ཀྱང་རྙེད་པ་ལེགས་པར་རྙེད་པ་ལགས་ཏེ།
en: Similarly, I have achieved much that is good.

source: བདག་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་རབ་ཏུ་འབྱུང་བ་དང་། བསྙེན་པར་རྫོགས་ཤིང་དགེ་སློང་གི་དངོས་པོ་འཐོབ་ཏུ་རུང་ན།
en: If permitted I wish to go forth in the Dharma and Vinaya so well spoken, complete my novitiate, and achieve full ordination.

source: བདག་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་ཐད་དུ་ཚངས་པར་སྤྱད་པ་སྤྱོད་པར་འཚལ་ལོ་ཞེས་བྱས་སོ། །
en: In the presence of the Blessed One, I too wish to practice the holy life.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Venerable Ānanda rose from his seat, drew down the right shoulder of his upper garment, bowed toward the Blessed One with palms pressed together, and asked the Blessed One,

source: བཙུན་པ་ཀུན་ཏུ་རྒྱུ་འདི་ནི་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་རབ་ཏུ་འབྱུང་བ་དང་། བསྙེན་པར་རྫོགས་ཤིང་དགེ་སློང་གི་དངོས་པོར་འགྱུར་བར་འཚལ་ན།
en: “Lord, this mendicant wishes to go forth in the Dharma and Vinaya so well spoken, complete his novitiate, and achieve full ordination.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཐུགས་བརྩེ་བའི་སླད་དུ་རབ་ཏུ་འབྱུང་བར་མཛད་པར་གསོལ།
en: I would like to request the Blessed One out of compassion to lead him to go forth.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཀུན་ཏུ་རྒྱུ་རབ་བཟང་ལ་དགེ་སློང་ཚུར་ཤོག་ཚངས་པར་སྤྱོད་ཅིག་ཅེས་བཀའ་སྩལ་ནས།
en: Then the Blessed One said to the mendicant Subhadra, “Come, monk! Practice the holy life.”

source: ཚིག་དེ་ཐོས་མ་ཐག་ཏུ་སྐྲ་དང་ཁ་སྤུ་ནི་བྲེགས་ནས་ཞག་བདུན་ལོན་པ་ཙམ་དུ་གྱུར། ཆོས་གོས་སྣམ་སྦྱར་ནི་གྱོན། སྤྱོད་ལམ་ནི་བསྙེན་པར་རྫོགས་ནས་ལོ་བརྒྱ་ལོན་པ་ལྟ་བུར་འདུག་པར་གྱུར། ལག་ན་ནི་ལྷུང་བཟེད་དང་ཆུ་སྣོད་ཐོགས་པར་གྱུར་ཏོ། །
en: As soon as the Blessed One had finished speaking there he stood, alms bowl and water pitcher in hand, with but a week’s worth of hair and beard, and with the deportment of a monk who had been ordained for one hundred years.

source: དེ་བཞིན་གཤེགས་པས་ཚུར་ཞེས་བཀའ་སྩལ་པས། །དེ་ནི་སྐྲ་བྲེགས་ལུས་ལ་སྣམ་སྦྱར་གྱོན། །སངས་རྒྱས་ཀྱིས་ནི་དགོངས་པས་གོས་བགོས་ནས། །མོད་ལ་དབང་པོ་རབ་ཏུ་ཞི་བར་གནས། །
en: Garbed in robes, with shaven heads, And senses stilled by Buddha’s will— From the very moment the One Thus Gone Spoke to them, saying, “Come, join me.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་ལུང་ཕོག་སྟེ། དེས་ཀྱང་བརྩོན་པ་དང་བསྒྲུབ་པ་དང་། འབད་པས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་ཏེ།
en: Then the Blessed One conferred on him instruction, and, casting away all afflictive emotions through diligence, practice, and effort, he manifested arhatship.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་བཟང་འདི་སྙམ་དུ་སེམས་ཏེ།
en: The thought occurred to Venerable Subhadra,

source: བདག་གིས་སྟོན་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་མཐོང་བར་བྱ་བ་ནི་བདག་གི་ཆ་མ་ཡིན་གྱིས།
en: “It is not my fate that I should see our teacher pass into parinirvāṇa,

source: མ་ལ་བདག་གིས་བྱིན་གྱི་རླབས་རྣམ་པ་ལྔ་བྱིན་གྱིས་བརླབས་ལ།
en: so I will make the following fivefold resolve:

source: དེ་བས་སྔར་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་བྱའོ་སྙམ་ནས་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་རྣམས་ཀྱིས་ནི་བདག་དགེ་སློང་གི་ཆ་ལུགས་སུ་མཐོང་བར་གྱུར་ཅིག །
en: “With the thought that I might enter nirvāṇa before the Buddha, may fellow practitioners of the holy life see me as a monk,

source: མུ་སྟེགས་པ་གཞན་རྣམས་ཀྱིས་ནི་མུ་སྟེགས་པའི་ཆ་ལུགས་སུ་མཐོང་བར་གྱུར་ཅིག །
en: and may those who hold extreme views see me as one who holds extreme views.

source: ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་རྣམས་ཀྱིས་ནི་བདེ་བླག་ཏུ་བདག་གི་ཐད་དུ་འོང་ནུས་པར་གྱུར་ཅིག །
en: “May fellow practitioners of the holy life find it easy to come and see me,

source: མུ་སྟེགས་པ་གཞན་དག་ཞིག་གིས་ནི་ཆུ་ཆེན་པོས་བསྐོར་བར་མཐོང་བར་གྱུར་ཅིག །
en: and may others who hold extreme views see me as surrounded by a great mass of water.

source: ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་རྣམས་ཀྱིས་ནི་བདག་གི་རུས་བུ་ཁྱོགས་སུ་ཁྱེར་ནུས་པར་གྱུར་ཅིག །
en: “May fellow practitioners of the holy life bear my relics on a palanquin,

source: འདི་ལས་ཕྱི་རོལ་པ་རྣམས་ཀྱིས་ནི་བརྒྱའམ་སྟོང་གིས་ཀྱང་ཁྱེར་མི་ནུས་པར་གྱུར་ཅིག །
en: and may their opponents, be there even hundreds or thousands of them, not be able to lift them.

source: ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་རྣམས་ཀྱིས་ནི་བདག་གི་རུས་བུ་བསྲེག་པའི་མེ་སྦར་ནུས་པར་གྱུར་ཅིག །
en: “May fellow practitioners of the holy life kindle the fire to burn my relics,

source: འདི་ལས་ཕྱི་རོལ་པ་རྣམས་ཀྱིས་ནི་བརྒྱའམ་སྟོང་གིས་ཀྱང་སྦར་མི་ནུས་པར་གྱུར་ཅིག །
en: and may their opponents, be there even hundreds or thousands of them, not be able to light it.

source: ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་རྣམས་ཀྱིས་ནི་བདག་གི་རུས་བུ་མཐོང་བར་གྱུར་ལ།
en: “May fellow practitioners of the holy life view my relics,

source: མཐོང་ནས་ཀྱང་རུས་བུ་ལ་མཆོད་པ་བྱེད་པར་གྱུར་ཅིག །
en: and upon doing so, may they venerate my relics,

source: མུ་སྟེགས་པ་གཞན་རྣམས་ཀྱིས་ནི་མཐོང་བར་མ་གྱུར་ཅིག་ཅེས་བྱས་ནས་
en: and may others who hold extreme views not be able to view them.”

source: དེར་ཚེ་དང་ལྡན་པ་རབ་བཟང་གིས་བྱིན་གྱི་རླབས་རྣམ་པ་ལྔ་བྱིན་གྱིས་བརླབས་ཏེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་སོ། །
en: After Venerable Subhadra had made this fivefold resolve, he passed into parinirvāṇa.

source: དེ་ནས་ཀུ་ཤིའི་གྲོང་ཁྱེར་དུ་ལྷ་རྣམས་ཀྱིས་རབ་བཟང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་སོ་ཞེས་སྒྲ་བསྒྲགས་སོ། །
en: All the gods in Kuśinagarī proclaimed that Subhadra had passed into parinirvāṇa,

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་མུ་སྟེགས་པ་གཞན་ཀུན་ཏུ་རྒྱུ་རྣམས་ཀྱིས་རས་ཀྱི་བ་དན་དག་བསྒྲེང་སྟེ། ལམ་པོ་ཆེ་དང་། སྲང་དང་། བཞི་མདོ་དང་། སུམ་མདོ་རྣམས་སུ་སྒྲ་བསྒྲགས་པ།
en: and as soon as the philosophical extremists heard this they hoisted banners made of cotton, announcing on the highways, in the streets, at crossroads, and at forks in the road,

source: དགེ་སྦྱོང་གཽ་ཏ་མ་ན་རེ་ཕྱི་རོལ་པའི་དགེ་སྦྱོང་དང་བྲམ་ཟེ་མེད་དེ། ཕ་རོལ་སྨྲ་བ་རྣམས་ནི་དགེ་སྦྱོང་ངམ་བྲམ་ཟེས་སྟོང་ངོ་ཞེས་དེ་སྐད་དུ་འཁོར་འདིར་ང་ཡང་དག་པའི་སེང་གེའི་སྒྲ་སྒྲོགས་སོ་ཞེས་ཟེར་ལ།
en: “The ascetic Gautama claims there are no ascetics or brahmins from other factions, for they are proponents of other views devoid of ascetics and brahmins. With a lion’s perfect roar he proclaimed this before the assembly.”

source: ད་ནི་བདག་ཅག་གི་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་འདི་ཡང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་སོ་ཞེས་ཀུ་ཤིའི་གྲོང་ཁྱེར་ཐོག་ཐག་ཏུ་བསྒྲགས་ནས་
en: They went all over Kuśinagarī, proclaiming, “This practitioner of our code of conduct has now passed into parinirvāṇa!”

source: ཤིང་ས་ལ་ཟུང་གི་ཚལ་དུ་དོང་སྟེ་རབ་བཟང་ག་ལ་འདུག་པ་དེར་ཆས་པ་ལས་དེའི་ཐད་དུ་འགྲོ་མ་ནུས་སོ། །
en: Then they went to the copse of two śāla trees where Subhadra lay, but they were unable to enter.

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་དེ་དག་མཐོང་ནས།
en: The monks saw them and asked,

source: ཀྱེ་ཁྱེད་རྣམས་འདིར་ཅི་ལ་འོངས།
en: “What are you doing here?”

source: དེ་དག་གིས་སྨྲས་པ། བདག་ཅག་གི་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཏེ།
en: “Our friend, who practiced our code of conduct, has passed into parinirvāṇa.

source: བདག་ཅག་གིས་དེའི་རུས་བུ་ལ་མཆོད་པ་བྱའོ། །
en: We have come to venerate his relics,” they replied.

source: དགེ་སློང་རྣམས་ཀྱིས་སྨྲས་པ། འདི་ནི་ངེད་ཀྱི་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་ཡིན་གྱིས་ཁྱེད་ཀྱི་མ་ཡིན་ནོ། །
en: “It was our code of conduct he practiced, not yours,” the monks said.

source: ཅི་ཁྱེད་ཀྱིས་སྐྲ་བྲེགས་ལ་ཆོས་གོས་སྣམ་སྦྱར་གྱོན་པ་མ་མཐོང་ངམ།
en: “Didn’t you see him with a shaved head, wearing holy robes and patched raiment?”

source: དེ་དག་གིས་སྨྲས་པ། བདག་ཅག་གིས་ནི་དབྱུག་གུ་གསུམ་དང་། རིལ་བ་སྤྱི་བླུགས་ཐོགས་པ་དེ་ལྟ་བུར་མཐོང་ངོ་། །
en: “We saw him carrying three sticks and a ritual vase,” they replied.

source: དགེ་སློང་རྣམས་ཀྱིས་སྨྲས་པ། གལ་ཏེ་འདི་ཁྱེད་ཀྱི་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་ཡིན་ཞེ་ན། འདིའི་ཐད་དུ་ཤེག་ལ་མཆོད་པ་གྱིས་ཤིག །
en: “If you believe he was practicing your code of conduct, then go ahead with your veneration,” said the monks.

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་མུ་སྟེགས་པ་གཞན་དག་རབ་བཟང་གི་ཐད་དུ་འགྲོ་འདོད་པ་ལས་ཆུ་ཆེན་པོས་བསྐོར་བར་མཐོང་ནས་འགྲོ་མ་ནུས་སོ། །
en: When they heard this the extremists wished to go see Subhadra, but they found he was surrounded by a great mass of water and could not proceed.

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་སྨྲས་པ། འདི་ནི་ངེད་ཀྱི་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་ཡིན་གྱིས་ཁྱེད་ཀྱི་མ་ཡིན་ནོ། །
en: “It was our code of conduct he practiced, not yours,” the monks said to them.

source: འདི་ལྟར་ངེད་ནི་འདིའི་ཐད་དུ་བདེ་བླག་ཏུ་འགྲོ་ནུས་པ་ཡིན་ཏེ།
en: “Thus it is easy for us to approach him.

source: ཁྱེད་ཀྱང་ངེད་ཀྱི་མཐུས་འདིའི་ཐད་དུ་ཤེག་ཅིག་ཅེས་བྱས་ནས་དེ་དག་ཐམས་ཅད་རབ་བཟང་གི་རུས་བུའི་ཐད་དུ་དོང་ངོ་། །
en: You may go to see him, with our consent.” So they all went to where Subhadra’s relics lay.

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་སྨྲས་པ། གལ་ཏེ་ཁྱེད་ཀྱི་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་ཡིན་ཞེ་ན། འདིའི་ཁྱོགས་ཁྱེར་ཅིག །
en: The monks said, “If you think he was practicing your disciplines, then carry his palanquin.”

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་མུ་སྟེགས་པ་གཞན་ཀུན་ཏུ་རྒྱུ་དེ་དག་གིས་ཁྱོགས་བསྐུར་ཞེས་བྱས་ན། གདེག་པར་མ་ནུས་སོ། །
en: As soon as the extremists heard this, they all said, “We will carry Subhadra’s palanquin!” but found they were unable to lift it.

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་སྨྲས་པ། འདི་ནི་ངེད་ཀྱི་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་ཡིན་ཏེ།
en: “It was our code of conduct he practiced,” said the monks,

source: ངེད་ཀྱིས་འདིའི་ཁྱོགས་ཁྱེར་ཏེ་བཀུར་སྟི་བགྱིས་ལྟོས་ཤིག་ཅེས་བྱས་ནས་
en: “so we will carry his palanquin and pay him homage—look here!”

source: དགེ་སློང་རྣམས་ཀྱིས་ཁྱོགས་ཁྱེར་ཏེ་
en: And the monks carried his palanquin.

source: གང་དུ་བསྲེག་པའི་གནས་སུ་བཞག་ནས་དགེ་སློང་རྣམས་ཀྱིས་སྨྲས་པ།
en: After they placed it in the charnel grounds the monks said,

source: གལ་ཏེ་འདི་ཁྱེད་ཀྱི་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་ཡིན་ཞེ་ནརུས་བུ་བསྲེག་པའི་མེ་བུས་ཤིག །
en: “If you think he was practicing your disciplines, then kindle the fire to burn his relics.”

source: དེ་ནས་མུ་སྟེགས་པ་གཞན་དག་གིས་རུས་བུ་བསྲེག་པའི་མེ་སྦར་ཞེས་བྱས་ན་སྦར་མ་ནུས་སོ། །
en: “We’ll light the fire to burn his relics!” the extremists said, but they were unable to light the fire.

source: འདིའི་རུས་བུ་བསྲེག་པའི་མེ་བདག་ཅག་གིས་སྦར་རོ་ཞེས་བྱས་ནས་དགེ་སློང་རྣམས་ཀྱིས་དེའི་རུས་བུ་བསྲེག་པའི་མེ་སྦར་རོ། །
en: “so we will light the fire to burn his relics.” After they said this, the monks lit the fire to burn his relics.

source: རུས་བུ་བསྲེག་པའི་མེ་སྦར་ནས་ཡང་སྨྲས་པ། གལ་ཏེ་འདི་ཁྱོད་ཀྱི་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་ཡིན་ཞེ་ན། ཁྱོད་ཀྱིས་འདིའི་རུས་བུ་བསྲེགས་པའི་མེ་འོ་མས་སོད་ཅིག་ཅེས་བྱས་ནས།
en: Then they continued, “If you think he was practicing your disciplines, extinguish the fire burning his relics with milk.”

source: མུ་སྟེགས་པ་གཞན་དག་གིས་དེའི་རུས་བུ་བསྲེགས་པའི་མེ་བསད་ཅེས་བྱས་ན་གསོད་མ་ནུས་སོ། །
en: “We’ll extinguish the fire burning his relics!” the extremists said, but they were not able to put it out.

source: ངེད་ཀྱིས་འདིའི་རུས་བུ་བསྲེགས་པའི་མེ་བསད་དོ་ཞེས་བྱས་ནས་དགེ་སློང་རྣམས་ཀྱིས་དེའི་རུས་བུ་བསྲེགས་པའི་མེ་བསད་དོ། །
en: “so we will extinguish the fire burning his relics,” and they extinguished the fire burning his relics.

source: མེ་བསད་ནས་ཡང་སྨྲས་པ། གལ་ཏེ་འདི་ཁྱེད་ཀྱི་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་ཡིན་ཞེ་ན། འདིའི་རུས་བུ་འདི་རྣམས་ལོང་ལ་མཆོད་པ་གྱིས་ཤིག །
en: After extinguishing the fire, they continued, “If you think he was practicing your disciplines, take up his relics and venerate them.”
